{
  "title": "Killing a side project",
  "date": "19th August 2019",
  "author": "Nick Rosen",
  "body": "I usually have some sort of side project going on, spoiler alert none have been massive hits.  I recently decided to kill of my browser design tool project and thought I'd write about the decision process of how and when I decide to kill a project in the context of this project.\n\nThe idea behind Browser Design Tools (BDT) was essentially to improve the design/development process for people like me who like to design in the browser.  The core feature is the ability to wrap the page in an iframe sized to a specific device like iphoneX or desktop browser that is scalable so you can render all of the sizes you need at one time so you can make sure you're properly responsive at all the required sizes.  I built this part out as a chrome extension and it works fine but I didn't really feel like it was solving a problem for me.  I thought if I added the abaility to write new media queries for each size it would add enough functionality to inspire me to use this tool I built but I still prefer to just default to the dev tools.  I had some other ideas for functionality but I just don't see it moving the needle, so I kind of back burnered the project without actually killing it.\n\nReasons for finally killing the project:\n\n\\-  I listened to an episode of Shop Talk Show where the guest was a css advocate from Google that built a really similar concept but way more robust tool set aimed more at designers called VisBug.  This led to a familiar situation where I've built a side project to solve my own problem and then I find a better solution that doesn't require me to do any work, I consider this a win.\n\n\\-  I decided BDT needed to be a browser extension but I didn't know how to build a browser extension so I learned(shocker - it's just HTML, CSS and JS) but in learning about the underlying functionality browser extensions are capable I thought of a bunch more browser extensions I'd like to build for myself.\n\n\\-  Anything I build, I'm treating as a learning experience because I've never built an app that didn't require me to learn something new.  Learning something is my bar, so if I build a 3/4 product and scrap it but learn a bunch of stuff in the process, I consider that a succesfull project."
}